sebailfico/sono-loco/esp32-code/src/main.cpp
/**
 * SonoLoco — Unified Multi-Room Audio Firmware
 *
 * Every node runs this same firmware. Roles are negotiated at runtime:
 *
 *   DISCOVERY → phone connects via BT  → SERVER (plays locally + ESP-NOW broadcast)
 *   DISCOVERY → ESP-NOW audio detected → CLIENT (receives + plays via I2S)
 *   SERVER    → phone disconnects      → DISCOVERY
 *   CLIENT    → ESP-NOW silent 5s      → DISCOVERY
 *
 * Compile with -DENABLE_BLUETOOTH=1 for nodes with BT Classic (ESP32 WROOM/WROVER).
 * Nodes without BT (e.g. ESP32-S3) will always operate as CLIENT.
 *
 * Hardware: ESP32 DevKit + PCM5102 DAC (I2S) + TPA3116 Amplifier
 */

#include <Arduino.h>
#include "config.h"
#include <driver/i2s.h>
#include <math.h>
#include <string.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_netif.h>
#include <esp_event.h>
#include <esp_idf_version.h>
#include <esp_timer.h>
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_mac.h>   // esp_read_mac moved out of esp_system.h in IDF 5
#endif
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <Preferences.h>

// Hardware-independent parts of the CLIENT receive path, tested on the host
// with `pio test -e native` — see test/test_jitter.
#include "drift.h"
#include "jitter.h"
#include "seqtracker.h"

#ifdef ENABLE_BLUETOOTH
#include "BluetoothA2DPSink.h"
#endif

// ============================================================================
// State Machine
// ============================================================================

enum DeviceMode { MODE_DISCOVERY, MODE_SERVER, MODE_CLIENT };
volatile DeviceMode currentMode = MODE_DISCOVERY;

// ============================================================================
// Bench mode
// ============================================================================
//
// A runtime mode for automated multi-board testing — see tools/bench-mesh.ps1
// and docs/bench-test.md. It exists because the normal SERVER role needs a phone
// to connect over Bluetooth, which cannot be automated, so there would otherwise
// be no way to produce a stream unattended.
//
// In bench mode a node never starts Bluetooth. That matters for more than
// convenience: the BT/WiFi coexistence problem that keeps a WROOM off the mesh
// (D3) only exists while the BT stack is running, so with BT off a WROOM can
// join the mesh perfectly well. Bench mode therefore works on every board.
//
// The flag lives in RTC memory, which survives ESP.restart(). That is
// deliberate: bench mode has to be chosen before setup() decides whether to
// start Bluetooth, so the node has to be told and then restarted.
//
// RTC_NOINIT_ATTR, not RTC_DATA_ATTR. `.rtc.data` is re-initialised from the
// image on every boot that runs the bootloader, so a RTC_DATA_ATTR flag is
// already zero again by the time setup() reads it and the node just reboots
// into normal mode. `.rtc_noinit` is left alone, which is the whole point.
// The cost is that its value is undefined on a cold boot, hence a magic number
// rather than a bool.
#define BENCH_MAGIC 0xB0FFE501
RTC_NOINIT_ATTR static uint32_t benchMagic;

static bool benchMode   = false;   // this boot is a bench boot
static bool benchSource = false;   // this node is generating the test stream

// ============================================================================
// Client-only mode
// ============================================================================
//
// A node told never to be a server: Bluetooth is not started, so ESP-NOW runs
// without the coexistence problem that needs PSRAM, and a WROOM becomes a usable
// mesh client instead of a standalone speaker. See the D3 amendment.
//
// Unlike bench mode this is a *setting*, not a test mode, so it lives in NVS
// rather than RTC memory. RTC memory survives a restart but not a power cut, and
// a node wired into a room is expected to come back as what it was after the
// power blinks. Bench mode staying volatile is equally deliberate: a board left
// in a test mode by a power cut is a trap, not a feature.
static Preferences prefs;
static bool        clientOnly = false;

static const char *PREF_NAMESPACE = "sonoloco";
static const char *PREF_CLIENT_ONLY = "clientonly";

/**
 * Whether this boot may run the Bluetooth stack at all.
 *
 * One predicate rather than a condition repeated at each call site: BT is
 * started from setup() and restarted whenever a node leaves CLIENT, and a node
 * that skipped BT at boot must not acquire it later on a mode change. On a WROOM
 * that would be the D3 crash arriving several minutes after boot, which is a
 * miserable thing to debug.
 */
static inline bool btAllowed() {
    return !benchMode && !clientOnly;
}

// ============================================================================
// I2S write helper
// ============================================================================

/**
 * i2s_write() is allowed to accept FEWER bytes than requested — it returns what
 * it actually queued in `bytes_written` and that is frequently less than the
 * full buffer when the DMA ring is busy. Callers that ignore it silently throw
 * audio away. This helper loops until everything is out, or gives up if the DMA
 * is not draining at all (e.g. another owner has taken over the peripheral).
 *
 * Returns the number of bytes actually written.
 */
static size_t i2sWriteAll(const void *src, size_t bytes, TickType_t timeout) {
    const uint8_t *p = (const uint8_t *)src;
    size_t done = 0;
    while (done < bytes) {
        size_t bw = 0;
        if (i2s_write(I2S_NUM_0, p + done, bytes - done, &bw, timeout) != ESP_OK) break;
        if (bw == 0) break;   // DMA not draining — bail rather than spin forever
        done += bw;
    }
    return done;
}

// ============================================================================
// Tone Generation (startup / connect / disconnect sounds)
// ============================================================================

#define NOTE_C5  523
#define NOTE_E5  659
#define NOTE_G5  784
#define NOTE_A5  880

void playTone(uint16_t freq, uint16_t durationMs, uint16_t amp = TONE_AMPLITUDE) {
    const int total = (BT_SAMPLE_RATE * durationMs) / 1000;
    const int chunk = 512;
    const int fade  = BT_SAMPLE_RATE * TONE_FADE_MS / 1000;
    int16_t buf[chunk * 2];
    int written = 0;

    while (written < total) {
        int n = min(chunk, total - written);

