sebailfico/sono-loco/esp32-code/src/main.cpp
    lastRxMs = millis();
    rxCount++;

    if (currentMode == MODE_DISCOVERY) {
        rxActive = true;   // signal main loop to switch to CLIENT
        return;
    }

    if (currentMode != MODE_CLIENT) return;

    // Duplicate / reordered / restarted-server handling, including the unsigned
    // 65535-gap trap, is in SeqTracker and covered by the host tests.
    const SeqResult sr = seqTracker.update(seq);
    if (!sr.accept) return;   // exact retransmit — replaying it is an audible stutter

    // Substitute silence for lost packets so playback keeps its timing instead
    // of splicing the stream shorter on every loss.
    if (sr.fillPackets > 0 &&
        !jbuf.pushSilence(sr.fillPackets * ESPNOW_PAYLOAD_SIZE)) {
        rxOverflow++;
    }

    if (!jbuf.pushBlock(data + ESPNOW_HEADER_SIZE, n)) rxOverflow++;
}

static bool espnowActive = false;

static void setupESPNow() {
    // BT Classic + WiFi simultaneously requires PSRAM on ESP32.
    // Without PSRAM, WiFi takes ~80KB of the only ~215KB available DRAM heap,
    // leaving the BT stack unable to allocate L2CAP/AVDTP buffers → crash.
    //
    // Guard: only init WiFi if PSRAM is present OR BT is not compiled in.
    // - WROOM (no PSRAM, BT enabled)  → skip WiFi; acts as BT speaker only
    // - S3    (PSRAM,  BT disabled)   → init WiFi; acts as ESP-NOW client
    // - WROVER (PSRAM, BT enabled)    → init WiFi; fully interchangeable
#ifdef ENABLE_BLUETOOTH
    // Bench mode never starts Bluetooth, so there is no coexistence problem and
    // no reason to refuse WiFi — this is what lets a WROOM be tested at all.
    // The guard is about BT and WiFi running *together*. Bench mode and
    // client-only mode both mean Bluetooth is never started, so neither needs
    // PSRAM to run the mesh — which is exactly what makes a WROOM a usable
    // client rather than a standalone speaker. See the D3 amendment.
    const bool btWillStart = btAllowed();
    if (btWillStart && ESP.getPsramSize() == 0) {
        LOG_WARN("No PSRAM detected — WiFi/ESP-NOW disabled to protect BT heap.");
        LOG_WARN("This node will play locally only (no mesh). Set client-only mode ('c')");
        LOG_WARN("to use it as a mesh client instead, or upgrade to a WROVER.");
        return;
    }
    if (!btWillStart && ESP.getPsramSize() == 0) {
        LOG_INFO("No PSRAM, but Bluetooth is off this boot, so ESP-NOW is safe here.");
    }
#endif

    // esp_wifi_init() needs the netif layer and a default event loop in place.
    // Both are no-ops (ESP_ERR_INVALID_STATE) if Arduino already set them up.
    esp_netif_init();
    esp_event_loop_create_default();

    // RX stays at the IDF default. It was trimmed to 4 on the theory that "PSRAM
    // handles the rest" — it does not: WiFi static RX buffers are DMA-capable
    // internal DRAM and cannot live in PSRAM. All that trim bought was a receiver
    // four packets deep against a continuous ~220 pkt/s stream, i.e. unexplained
    // `lost` counts. TX is safe to trim because the send semaphore keeps exactly
    // one frame in flight.
    wifi_init_config_t wcfg = WIFI_INIT_CONFIG_DEFAULT();
    wcfg.static_rx_buf_num  = WIFI_STATIC_RX_BUFFERS;
    wcfg.dynamic_tx_buf_num = WIFI_DYNAMIC_TX_BUFFERS;

    esp_err_t ret = esp_wifi_init(&wcfg);
    if (ret != ESP_OK) {
        LOG_ERROR("WiFi init failed: " + String(esp_err_to_name(ret)));
        return;
    }
    esp_wifi_set_mode(WIFI_MODE_STA);
    esp_wifi_set_storage(WIFI_STORAGE_RAM);
    esp_wifi_start();

    // Modem sleep parks the radio between beacons and makes ESP-NOW reception
    // miss packets. A continuous audio stream needs the receiver always on.
    esp_wifi_set_ps(WIFI_PS_NONE);

    // Fixed channel — must match on all nodes
    esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
    LOG_INFO("Heap after WiFi init: " + String(ESP.getFreeHeap()) + " bytes");

    if (esp_now_init() != ESP_OK) {
        LOG_ERROR("ESP-NOW init failed");
        return;
    }

    esp_now_register_send_cb(onEspNowSent);
    esp_now_register_recv_cb(onEspNowRecv);

    esp_now_peer_info_t peer = {};
    memcpy(peer.peer_addr, BROADCAST_ADDR, 6);
    peer.channel = ESPNOW_CHANNEL;
    peer.encrypt = false;
    if (esp_now_add_peer(&peer) != ESP_OK) {
        LOG_ERROR("ESP-NOW add peer failed");
        return;
    }

    txDone = xSemaphoreCreateBinary();
    if (!txDone) {
        LOG_ERROR("TX semaphore alloc failed");
        return;
    }
    xSemaphoreGive(txDone);   // radio starts idle

    txQueue = xQueueCreate(ESPNOW_TX_QUEUE_DEPTH, sizeof(AudioPacket));
    if (!txQueue) {
        LOG_ERROR("TX queue alloc failed");
        return;
    }
    xTaskCreatePinnedToCore(espnowTxTask, "espnow_tx", 4096, nullptr, 5, nullptr, 1);

    uint8_t mac[6];
    esp_wifi_get_mac(WIFI_IF_STA, mac);
    char macStr[18];
    snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    LOG_INFO("ESP-NOW ready — MAC: " + String(macStr));
    LOG_INFO("Heap after ESP-NOW init: " + String(ESP.getFreeHeap()) + " bytes");
    espnowActive = true;
}

// ============================================================================
// Bluetooth A2DP — SERVER mode, BT Classic nodes only
// ============================================================================

#ifdef ENABLE_BLUETOOTH

BluetoothA2DPSink a2dpSink;
volatile bool btConnected       = false;
volatile bool doConnectSound    = false;
volatile bool doDisconnectSound = false;
// Not `btStarted` — Arduino's esp32-hal-bt.h already declares `bool btStarted()`
// at global scope, and the collision is a hard compile error.
static bool   btSinkStarted     = false;

// Half-band-ish 4-tap FIR [1 3 3 1]/8 running at the input rate. Taking every
// other sample without this folds all 11–22 kHz content back into the audible
// band (cymbals and sibilance turn to fizz), which is what naive decimation did.
static int32_t decimHist[4] = {0, 0, 0, 0};
static bool    decimPhase   = false;

static inline void decimReset() {
    decimHist[0] = decimHist[1] = decimHist[2] = decimHist[3] = 0;
    decimPhase = false;
}

// Called from BT task. Downsamples 44100Hz stereo → 22050Hz mono and queues
// ESP-NOW packets. The BT library still drives I2S locally (local playback).
static void a2dpDataCallback(const uint8_t *data, uint32_t length) {
    if (currentMode != MODE_SERVER || !txReady || !espnowActive) return;
    // Signed, for the reason spelled out at the ESP-NOW silence check: this
    // timestamp is written from the A2DP state callback, and an unsigned
    // difference against a timestamp set a moment in the future wraps to a huge
    // number — here that would silently skip the warmup instead of enforcing it.
    if ((long)(millis() - audioStartMs) < (long)TX_WARMUP_MS) return;

    const int16_t *in      = (const int16_t *)data;
    const int      nStereo = length / 4;   // 4 bytes per stereo sample pair

    for (int i = 0; i < nStereo; i++) {
        int32_t mono = ((int32_t)in[i * 2] + (int32_t)in[i * 2 + 1]) >> 1;

        decimHist[3] = decimHist[2];
        decimHist[2] = decimHist[1];
        decimHist[1] = decimHist[0];
        decimHist[0] = mono;

        decimPhase = !decimPhase;
        if (decimPhase) continue;   // output one sample per two inputs

        int32_t filtered =
            (decimHist[0] + 3 * decimHist[1] + 3 * decimHist[2] + decimHist[3]) >> 3;
        if (filtered >  32767) filtered =  32767;
        if (filtered < -32768) filtered = -32768;
        int16_t out = (int16_t)filtered;

        memcpy(accumBuf + accumLen, &out, 2);
        accumLen += 2;

        if (accumLen >= ESPNOW_PAYLOAD_SIZE) {
            AudioPacket pkt;
            pkt.seq = txSeq++;
            pkt.len = ESPNOW_PAYLOAD_SIZE;
            memcpy(pkt.data, accumBuf, ESPNOW_PAYLOAD_SIZE);
            if (xQueueSend(txQueue, &pkt, 0) != pdTRUE) txQueueFull++;
            accumLen = 0;
        }
    }
}

static void btConnectionChanged(esp_a2d_connection_state_t state, void *) {
    if (state == ESP_A2D_CONNECTION_STATE_CONNECTED) {
        LOG_INFO("BT connected");
        btConnected    = true;
        doConnectSound = true;
    } else if (state == ESP_A2D_CONNECTION_STATE_DISCONNECTED) {
        LOG_INFO("BT disconnected");
        btConnected       = false;
        doDisconnectSound = true;
    }
}

