sebailfico/sono-loco/esp32-code/src/main.cpp
static void btAudioChanged(esp_a2d_audio_state_t state, void *) {
    if (state == ESP_A2D_AUDIO_STATE_STARTED) {
        txReady      = true;
        audioStartMs = millis();
        decimReset();
        accumLen = 0;
        LOG_INFO("BT audio started → ESP-NOW TX will activate in " + String(TX_WARMUP_MS) + "ms");
    } else {
        txReady      = false;
        audioStartMs = 0;
        LOG_INFO("BT audio stopped → ESP-NOW TX paused");
    }
}

static void startBluetooth() {
    if (btSinkStarted) return;

    i2s_pin_config_t pins = {
        .mck_io_num   = I2S_PIN_NO_CHANGE,
        .bck_io_num   = I2S_BCK_PIN,
        .ws_io_num    = I2S_WS_PIN,
        .data_out_num = I2S_DATA_PIN,
        .data_in_num  = I2S_PIN_NO_CHANGE
    };
    a2dpSink.set_pin_config(pins);
    a2dpSink.set_stream_reader(a2dpDataCallback, true);  // true = keep local I2S output
    a2dpSink.set_on_connection_state_changed(btConnectionChanged);
    a2dpSink.set_on_audio_state_changed(btAudioChanged);
    a2dpSink.set_auto_reconnect(false);
    a2dpSink.set_volume(VOLUME_DEFAULT);
    a2dpSink.start(BT_DEVICE_NAME);
    btSinkStarted = true;
    LOG_INFO("BT discoverable as: " BT_DEVICE_NAME);
}

static void stopBluetooth() {
    if (!btSinkStarted) return;
    // end(false) keeps the BT controller in memory so start() works again.
    // end(true) releases it, and every later attempt to become a SERVER fails
    // until the node is power-cycled — which breaks the whole "any node can be
    // either role" premise.
    a2dpSink.end(false);
    btSinkStarted = false;
    LOG_INFO("BT stopped (controller retained for restart)");
}

#endif  // ENABLE_BLUETOOTH

// ============================================================================
// I2S Client Output — CLIENT mode
// ============================================================================

static bool clientI2SActive = false;

static void initI2SForClient() {
    i2s_config_t cfg = {
        .mode                 = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
        .sample_rate          = CLIENT_SAMPLE_RATE,
        .bits_per_sample      = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format       = I2S_CHANNEL_FMT_RIGHT_LEFT,
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
        .intr_alloc_flags     = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count        = CLIENT_DMA_BUF_COUNT,
        .dma_buf_len          = CLIENT_DMA_BUF_LEN,
        .use_apll             = false,
        .tx_desc_auto_clear   = true
    };
    i2s_pin_config_t pins = {
        .mck_io_num   = I2S_PIN_NO_CHANGE,
        .bck_io_num   = I2S_BCK_PIN,
        .ws_io_num    = I2S_WS_PIN,
        .data_out_num = I2S_DATA_PIN,
        .data_in_num  = I2S_PIN_NO_CHANGE
    };
    esp_err_t err = i2s_driver_install(I2S_NUM_0, &cfg, 0, nullptr);
    if (err != ESP_OK) {
        LOG_ERROR("I2S install (client) failed: " + String(esp_err_to_name(err)));
        return;
    }
    i2s_set_pin(I2S_NUM_0, &pins);
    i2s_zero_dma_buffer(I2S_NUM_0);
    clientI2SActive = true;
    LOG_INFO("I2S initialised for CLIENT mode at " + String(CLIENT_SAMPLE_RATE) + " Hz mono");
}

static void deinitI2SForClient() {
    if (!clientI2SActive) return;
    i2s_zero_dma_buffer(I2S_NUM_0);
    i2s_driver_uninstall(I2S_NUM_0);
    clientI2SActive = false;
}

// Drive I2S from jitter buffer — called every loop() tick in CLIENT mode.
static void driveClientI2S() {
    if (!clientI2SActive) return;

    // Wait for prefill before starting output (prevents immediate underrun)
    if (!jReady) {
        if (jbuf.fill() >= JITTER_PREFILL) {
            jReady = true;
            LOG_INFO("Jitter buffer ready (" + String(jbuf.fill()) + " bytes) — starting I2S");
        } else {
            return;
        }
    }

    static int16_t mono[CLIENT_BATCH];
    static int16_t stereo[CLIENT_BATCH * 2];

    if (!jbuf.peek((uint8_t *)mono, CLIENT_BATCH * 2)) {
        // Underrun. tx_desc_auto_clear already zeroes the DMA as it drains, so
        // pushing extra silence here would only add a click. Re-arm the prefill
        // gate and let the buffer refill. Counted, not logged — logging every
        // loop tick during an underrun makes the underrun worse.
        jReady = false;
        rxUnderrun++;
        // The refill that follows is not drift. Integrating it would provoke a
        // burst of corrections on top of a buffer that is already unhappy.
        driftCtl.reset(millis());
        return;
    }

    // Ask before the batch, apply after it. Keeping the correction outside the
    // batch is what leaves the partial-write accounting below untouched: one
    // sample either side of a write whose length is already handled correctly,
    // rather than an edit in the middle of a buffer that I2S may only half take.
    DriftController::Correction corr = DriftController::NONE;
    if (driftEnabled) corr = driftCtl.update(millis(), jbuf.fill());

    // Expand mono → stereo (duplicate sample to both channels)
    for (int i = 0; i < CLIENT_BATCH; i++) {
        stereo[i * 2]     = mono[i];
        stereo[i * 2 + 1] = mono[i];
    }

    // Blocking with a short timeout paces this loop to the I2S sample clock.
    size_t bw = 0;
    i2s_write(I2S_NUM_0, stereo, CLIENT_BATCH * 4, &bw, pdMS_TO_TICKS(20));

    // Consume only what the DMA actually took. The previous version advanced
    // the read pointer unconditionally, discarding every sample I2S refused —
    // which at loop() speed was most of them.
    //
    // Round down to whole stereo frames first. i2s_write normally returns a
    // multiple of 4 here, but if it ever returned a partial frame, bw/2 would be
    // an odd number of mono bytes and the jitter buffer's 16-bit framing would be
    // permanently shifted — the exact failure pushBlock exists to prevent.
    const size_t frames = (bw & ~(size_t)3) / 4;
    jbuf.advance((int)frames * 2);             // 4 bytes written per 2 bytes of mono

    // One sample of correction, at a batch boundary. At the drift these boards
    // actually have that is one edit every 1.5 s: inaudible, and it needs no
    // resampler. Nothing is counted unless it happened -- an I2S write that came
    // up short leaves the correction owed, and it is applied next batch instead.
    if (corr == DriftController::DROP) {
        // Consume a sample without playing it. Two bytes, so the buffer's 16-bit
        // framing survives -- the one thing this path must never get wrong.
        if (jbuf.fill() >= 2) {
            jbuf.advance(2);
            driftCtl.confirm(corr);
        }
    } else if (corr == DriftController::INSERT && frames > 0) {
        // Play a sample twice without consuming it: hold the value one extra
        // sample period. No discontinuity is possible by construction, because
        // it is the sample that was just played.
        const int16_t held  = mono[frames - 1];
        int16_t frame[2]    = {held, held};
        size_t  bwExtra     = 0;
        i2s_write(I2S_NUM_0, frame, sizeof(frame), &bwExtra, pdMS_TO_TICKS(20));
        if (bwExtra == sizeof(frame)) driftCtl.confirm(corr);
    }
}

// ============================================================================
// Mode Transitions
// ============================================================================

