sebailfico/sono-loco/esp32-code/src/main.cpp
    // Bounded catch-up: if this node was blocked for a while, send a few packets
    // back to back but never sit here spinning out a whole backlog.
    for (int burst = 0; burst < BENCH_MAX_CATCHUP_PKTS; burst++) {
        const int64_t due = benchStartUs +
            (int64_t)benchPktIdx * 1000000LL * (int64_t)samplesPerPkt / CLIENT_SAMPLE_RATE;
        if (now < due) return;

        AudioPacket pkt;
        pkt.seq = txSeq++;
        pkt.len = ESPNOW_PAYLOAD_SIZE;
        // Table lookup, wrapping by comparison rather than modulo: no division
        // and no float anywhere in the transmit path.
        for (uint32_t i = 0; i < samplesPerPkt; i++) {
            memcpy(pkt.data + i * 2, &benchTone[benchTonePhase], 2);
            if (++benchTonePhase >= BENCH_TONE_LEN) benchTonePhase = 0;
        }
        benchSampleIdx += samplesPerPkt;

        if (xQueueSend(txQueue, &pkt, 0) != pdTRUE) txQueueFull++;
        else                                        benchTxPackets++;
        benchPktIdx++;
    }
}

static void benchStartSource() {
    if (!espnowActive) {
        DEBUG_SERIAL.println("[BENCH] error reason=espnow_inactive");
        return;
    }
    if (!benchToneReady) benchBuildTone();

    benchStartUs   = esp_timer_get_time();
    benchPktIdx    = 0;
    benchSampleIdx = 0;
    benchTonePhase = 0;
    benchTxPackets = 0;
    txQueueFull = txSendErr = txRadioFail = 0;
    benchSource    = true;
    currentMode    = MODE_SERVER;   // stops this node treating its own role as a listener
    DEBUG_SERIAL.printf("[BENCH] source start rate=%d hz=%d amp=%d\n",
                        CLIENT_SAMPLE_RATE, BENCH_TONE_HZ, BENCH_TONE_AMPLITUDE);
}

static void benchStopSource() {
    benchSource = false;
    DEBUG_SERIAL.printf("[BENCH] source stop tx=%lu\n", (unsigned long)benchTxPackets);
    enterDiscovery();
}

/**
 * One machine-parsable line per interval, in every mode, with every field
 * present whether or not it applies. `ms` is this node's own clock: the host
 * regresses it against PC time to get each board's ppm error, and the difference
 * between two boards is their relative drift.
 *
 * printf, not String concatenation — this runs once a second forever and the
 * String version fragments the heap.
 */
static void benchReport() {
    const char *modeStr = currentMode == MODE_DISCOVERY ? "DISCOVERY"
                        : currentMode == MODE_SERVER    ? "SERVER"
                                                        : "CLIENT";
    DEBUG_SERIAL.printf(
        "[BENCH] ms=%lu role=%s mode=%s heap=%lu jit=%d rx=%lu lost=%lu ovf=%lu "
        "und=%lu dup=%lu rsy=%lu tx=%lu qfull=%lu senderr=%lu radiofail=%lu "
        "drift=%d ins=%lu drp=%lu dr=%.3f tgt=%d srx=%ld\n",
        (unsigned long)millis(),
        benchSource ? "SOURCE" : "SINK",
        modeStr,
        (unsigned long)ESP.getFreeHeap(),
        jbuf.fill(),
        (unsigned long)rxCount,
        (unsigned long)seqTracker.lost,
        (unsigned long)rxOverflow,
        (unsigned long)rxUnderrun,
        (unsigned long)seqTracker.dupe,
        (unsigned long)seqTracker.resync,
        (unsigned long)benchTxPackets,
        (unsigned long)txQueueFull,
        (unsigned long)txSendErr,
        (unsigned long)txRadioFail,
        driftEnabled ? 1 : 0,
        (unsigned long)driftCtl.inserted,
        (unsigned long)driftCtl.dropped,
        // Corrections per second the controller is currently asking for. Once
        // the loop is closed this is the only in-band measure of drift left:
        // a corrected buffer no longer has a slope to regress.
        driftCtl.rate(),
        // The level being steered to. It is measured after the settle window
        // rather than computed, so recording it is the only way to tell a
        // correctly calibrated client from one steering at the wrong depth.
        driftCtl.target(),
        // Age of the last received packet, as the silence check sees it. Signed
        // and printed even when it is meaningless (a source has no rx), because
        // a value that goes *negative* or jumps is the evidence that the check
        // is misfiring rather than the radio going quiet.
        lastRxMs ? (long)(millis() - lastRxMs) : -1L);
}

static void benchIdentify() {
    uint8_t mac[6] = {0};
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    DEBUG_SERIAL.printf(
        "[BENCH] id fw=%s chip=%s psram=%lu mac=%02X:%02X:%02X:%02X:%02X:%02X "
        "bench=%d bt=%d espnow=%d drift=%d conly=%d name=%s\n",
        FW_VERSION,
        ESP.getChipModel(),
        (unsigned long)ESP.getPsramSize(),
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
        benchMode ? 1 : 0,
#ifdef ENABLE_BLUETOOTH
        1,
#else
        0,
#endif
        espnowActive ? 1 : 0,
        driftEnabled ? 1 : 0,
        clientOnly ? 1 : 0,
        ROOM_NAME);
}

/**
 * Single-character commands, so the host side needs no protocol.
 *
 *   ?  identify          b  reboot into bench mode     n  reboot into normal mode
 *   s  start sourcing    x  stop sourcing              r  report now
 *   d  toggle clock-drift correction
 *   c  toggle client-only mode and reboot (persists across power cuts)
 */
static void benchServiceSerial() {
    while (DEBUG_SERIAL.available()) {
        switch (DEBUG_SERIAL.read()) {
            case '?': benchIdentify(); break;
            case 'r': benchReport();   break;
            case 'd':
                // No restart needed: the controller is re-armed rather than
                // reconfigured, so one run can measure the same boards with
                // correction off and on without reflashing between them.
                driftEnabled = !driftEnabled;
                driftCtl.reset(millis());
                DEBUG_SERIAL.printf("[BENCH] drift=%d\n", driftEnabled ? 1 : 0);
                break;
            case 's': benchStartSource(); break;
            case 'x': benchStopSource();  break;
            case 'c': {
                // Persisted, then restarted: whether Bluetooth starts is decided
                // in setup(), so like bench mode this only takes effect on the
                // next boot. Unlike bench mode it is written to NVS, because a
                // node wired into a room should come back as what it was after
                // the power blinks.
                const bool next = !clientOnly;
                prefs.begin(PREF_NAMESPACE, false);
                prefs.putBool(PREF_CLIENT_ONLY, next);
                prefs.end();
                DEBUG_SERIAL.printf("[BENCH] clientonly=%d rebooting\n", next ? 1 : 0);
                DEBUG_SERIAL.flush();
                delay(50);
                ESP.restart();
                break;
            }
            case 'b':
                benchMagic = BENCH_MAGIC;
                DEBUG_SERIAL.println("[BENCH] rebooting into bench mode");
                DEBUG_SERIAL.flush();
                delay(50);
                ESP.restart();
                break;
            case 'n':
                benchMagic = 0;
                DEBUG_SERIAL.println("[BENCH] rebooting into normal mode");
                DEBUG_SERIAL.flush();
                delay(50);
                ESP.restart();
                break;
            default: break;   // ignore newlines and anything unrecognised
        }
    }
}

// ============================================================================
// Setup
// ============================================================================

void setup() {
    DEBUG_SERIAL.begin(DEBUG_BAUD_RATE);
    delay(1000);

    // Before the banner, because the banner reports it, and before
    // setupESPNow() and any decision about Bluetooth, because both depend on it.
    // Read-only handle — the only writer is the 'c' command.
    prefs.begin(PREF_NAMESPACE, true);
    clientOnly = prefs.getBool(PREF_CLIENT_ONLY, false);
    prefs.end();

    DEBUG_SERIAL.println();
    DEBUG_SERIAL.println("================================");
    DEBUG_SERIAL.println("  SonoLoco — Multi-Room Audio");
    DEBUG_SERIAL.println("  Firmware: " FW_VERSION);
#ifdef ENABLE_BLUETOOTH
    if (clientOnly) {
        DEBUG_SERIAL.println("  Mode: CLIENT only (configured — BT never starts)");
    } else {
        DEBUG_SERIAL.println("  Mode: SERVER capable (BT + ESP-NOW)");
    }
#else
    DEBUG_SERIAL.println("  Mode: CLIENT only (no BT Classic on this chip)");
#endif
    DEBUG_SERIAL.println("================================");
    DEBUG_SERIAL.println();

