sebailfico/sono-loco/esp32-code/src/main.cpp
    benchMode = (benchMagic == BENCH_MAGIC);
    if (benchMode) {
        DEBUG_SERIAL.println("[BENCH] boot bench=1 (Bluetooth disabled this boot)");
    }


    LOG_INFO("Chip: "    + String(ESP.getChipModel()));
    LOG_INFO("CPU:  "    + String(ESP.getCpuFreqMHz()) + " MHz");
    LOG_INFO("Heap: "    + String(ESP.getFreeHeap()) + " bytes");
    LOG_INFO("PSRAM: "   + String(ESP.getPsramSize()) + " bytes");

    // Startup sound — only on nodes with a DAC connected (BT-capable nodes).
    // Skipped in bench mode: it would delay the first telemetry line and it is
    // played through an I2S driver that the client path is about to reconfigure.
#ifdef ENABLE_BLUETOOTH
    if (!benchMode) {
        initI2SForTones();
        playStartupSound();
        deinitI2SForTones();
    }
#endif

    DriftController::Config dcfg;
    dcfg.targetBytes    = DRIFT_TARGET_BYTES;
    dcfg.targetCeilBytes = DRIFT_TARGET_CEIL_BYTES;
    dcfg.deadbandBytes = DRIFT_DEADBAND_BYTES;
    dcfg.kp            = DRIFT_KP;
    dcfg.maxRatePerSec = DRIFT_MAX_RATE;
    dcfg.emaTauMs      = DRIFT_EMA_TAU_MS;
    dcfg.settleMs      = DRIFT_SETTLE_MS;
    // begin() here and reset() everywhere else: the correction counters have to
    // outlive a mode change, or a bench run cannot total them.
    driftCtl.begin(dcfg, millis());

    // Must happen before ESP-NOW comes up: the recv callback starts pushing into
    // this buffer as soon as the radio is listening.
    if (!jbuf.init(jStorage, JITTER_BUF_SIZE)) {
        LOG_ERROR("Jitter buffer init failed — JITTER_BUF_SIZE must be a power of two");
    }

    // ESP-NOW must be up before BT to ensure coexistence layer is ready
    setupESPNow();

#ifdef ENABLE_BLUETOOTH
    if (btAllowed()) startBluetooth();
#endif

    LOG_INFO("Setup complete. Entering DISCOVERY...");
    if (benchMode) benchIdentify();
}

// ============================================================================
// Main Loop
// ============================================================================

void loop() {
    // Always listening for host commands, in every mode — this is how a node is
    // put into bench mode in the first place.
    benchServiceSerial();
    benchServiceSource();

    switch (currentMode) {

        case MODE_DISCOVERY:
#ifdef ENABLE_BLUETOOTH
            if (btConnected) {
                enterServer();
                break;
            }
#endif
            if (rxActive && espnowActive &&
                (long)(millis() - clientRetryAfterMs) >= 0) {
                enterClient();
            }
            break;

        case MODE_SERVER:
#ifdef ENABLE_BLUETOOTH
            // In bench mode SERVER means "sourcing the synthetic stream" and
            // there is no BT connection to lose, so none of this applies —
            // without the guard the node would leave SERVER on the first pass.
            // A client-only node never gets here at all.
            if (btAllowed()) {
                if (doConnectSound) {
                    doConnectSound = false;
                    playConnectedSound();
                }
                if (!btConnected) {
                    if (doDisconnectSound) {
                        doDisconnectSound = false;
                        playDisconnectedSound();
                    }
                    enterDiscovery();
                }
            }
#endif
            break;

        case MODE_CLIENT:
            driveClientI2S();

            // Read both once, and compare SIGNED.
            //
            // lastRxMs is written by the ESP-NOW receive callback on another
            // task. At 220 packets/s a packet lands between this read of
            // millis() and the read of lastRxMs often enough to matter, and the
            // timestamp is then a millisecond in the *future*. Unsigned, that
            // difference wraps to ~4.29e9 and sails past the threshold, so the
            // node declares five seconds of silence in the middle of a flawless
            // stream, drops to DISCOVERY and re-prefills the jitter buffer.
            // Audible, and it invalidates any drift measurement taken across it.
            //
            // Measured, not theorised: [BENCH] silence now=13822 last=13823
            // delta=4294967295 rx=14, and twice more in a 600 s run whose rx
            // counter was advancing by 221 packets every second throughout.
            //
            // Same idiom as clientRetryAfterMs below. Any comparison against a
            // timestamp another task writes needs it; the ones that only ever
            // compare against loop()'s own bookkeeping do not.
            {
            const unsigned long nowMs  = millis();
            const unsigned long lastMs = lastRxMs;
            const long          ageMs  = (long)(nowMs - lastMs);
            if (lastMs > 0 && ageMs > (long)ESPNOW_SILENCE_TIMEOUT_MS) {
                DEBUG_SERIAL.printf("[BENCH] silence now=%lu last=%lu age=%ld rx=%lu\n",
                                    nowMs, lastMs, ageMs, (unsigned long)rxCount);
                LOG_INFO("ESP-NOW silent for " + String(ESPNOW_SILENCE_TIMEOUT_MS / 1000) + "s → DISCOVERY");
                LOG_INFO("RX stats: rx=" + String(rxCount) +
                         " lost=" + String(seqTracker.lost) +
                         " overflow=" + String(rxOverflow) +
                         " underrun=" + String(rxUnderrun) +
                         " dupe=" + String(seqTracker.dupe) +
                         " resync=" + String(seqTracker.resync));
                enterDiscovery();   // clears the counters and lastRxMs
            }
            }
            break;
    }

    // Bench telemetry replaces the human-readable status line: the host parses
    // it, and two status lines a second would just interleave confusingly.
    if (benchMode) {
        if (millis() - benchLastReportMs >= BENCH_REPORT_MS) {
            benchLastReportMs = millis();
            benchReport();
        }
        return;
    }

    // Periodic status (DEBUG_LEVEL >= 3 only)
#if DEBUG_LEVEL >= 3
    static unsigned long lastStatus = 0;
    if (millis() - lastStatus > STATUS_INTERVAL_MS) {
        lastStatus = millis();
        const char *modeStr =
            currentMode == MODE_DISCOVERY ? "DISCOVERY" :
            currentMode == MODE_SERVER    ? "SERVER"    : "CLIENT";

        if (currentMode == MODE_CLIENT) {
            LOG_INFO(String("Status: mode=") + modeStr +
                     " heap=" + String(ESP.getFreeHeap()) +
                     " jitter=" + String(jbuf.fill()) + "B" +
                     " rx=" + String(rxCount) +
                     " lost=" + String(seqTracker.lost) +
                     " ovf=" + String(rxOverflow) +
                     " und=" + String(rxUnderrun) +
                     " dup=" + String(seqTracker.dupe) +
                     " rsy=" + String(seqTracker.resync));
        } else if (currentMode == MODE_SERVER) {
            LOG_INFO(String("Status: mode=") + modeStr +
                     " heap=" + String(ESP.getFreeHeap()) +
                     " qfull=" + String(txQueueFull) +
                     " senderr=" + String(txSendErr) +
                     " radiofail=" + String(txRadioFail));
        } else {
            LOG_INFO(String("Status: mode=") + modeStr +
                     " heap=" + String(ESP.getFreeHeap()));
        }
    }
#endif
}
